app/Controllers/Gereja.php

SELECT *
FROM `user`
WHERE `USERNAME` = 'ketua'
 LIMIT 1
---
    public function check()
    {
        $model = new UserModel();
        $usename = $this->request->getVar('usr');
        $password = $this->request->getVar('pwd');

        $user = $model->where('USERNAME', $usename)->first();