app/Controllers/Monev.php

SELECT *
FROM `rencana`
---
    public function getAllRencana()
    {
        $model = new RencanaModel();
        $data = $model->findAll();