app/Models/AgendaModel.php

    public function getDetails()
    {
        return $this->select('tim_programsi.*, bidang.nama_bidang, tim_pelayanan.nama_tim_pelayanan')
            ->join('bidang', 'bidang.id_bidang = tim_programsi.id_bidang')
            ->join('tim_pelayanan', 'tim_pelayanan.id_tim_pelayanan = tim_programsi.id_tim_pelayanan')
            ->findAll();
---
SELECT `tim_programsi`.*, `bidang`.`nama_bidang`, `tim_pelayanan`.`nama_tim_pelayanan`
FROM `tim_programsi`
JOIN `bidang` ON `bidang`.`id_bidang` = `tim_programsi`.`id_bidang`
JOIN `tim_pelayanan` ON `tim_pelayanan`.`id_tim_pelayanan` = `tim_programsi`.`id_tim_pelayanan`