app/Models/bidangModel.php

    public function getAllBidang()
    {
        return $this->findAll();
---
SELECT *
FROM `bidang`

    public function getTimPelayananByBidang($idBidang)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tim_pelayanan');
        $builder->where('id_bidang', $idBidang);
        $query = $builder->get();
        return $query->getResultArray();
---
SELECT *
FROM `bidang`