app/Models/UserModel.php

    public function saveUser($data)
    {
        $this->insert($data);
---
INSERT INTO `user` (`NAMA_LENGKAP`, `USERNAME`, `PASSWORD`, `STATUS`, `id_bidang`, `id_tim_pelayanan`) VALUES ('benda', 'benda', '123', 'Bendahara', '1', '1')